# Lab 6 Tasks - Solution

In this notebook we will work with a dataset containing records of car sales from dealerships in different parts of Ireland during a one-year period. Each row in the data represents the sale of a single car, described by the following features:

- *date*: the date when the car sale occurred
- *make*: the make or manufacturer of the car
- *model*: the specific model name of the car
- *year*: indicates the age of the car
- *transmission*: indicates if the car is manual, automatic, or semi-automatic
- *fuel_type*: specifies the type type of fuel used by the car
- *mileage*: the distance (in kilometres) that the car has previously been driven
- *region*: the province in Ireland where the car sale took place
- *sale_amount*: the amount (in euros) for which the car was sold

## Task 1 - Data Loading

Load the CSV file "car-sales.csv" into a Pandas DataFrame. Check the number of rows and the column names in the DataFrame.

In [124]:
from audioop import reverse

import pandas as pd
df = pd.read_csv("lab06-data/car-sales.csv")
print(df.shape)
print(df.keys())

(3805, 9)
Index(['date', 'make', 'model', 'year', 'transmission', 'fuel_type', 'mileage',
       'region', 'sale_amount'],
      dtype='object')

## Task 2 - Handling Missing Values

Check the extent to which there are features with missing values present in the features in the dataset.

In [125]:
df.isnull().sum()

date             0
make            12
model            0
year             0
transmission    52
fuel_type       40
mileage          0
region           0
sale_amount      0
dtype: int64

Apply appropriate data preprocessing to address any issues with missing values.

In [126]:
df["make"] = df["make"].fillna(df["make"].value_counts().sort_values(ascending=False).index[0])

In [127]:
df["transmission"] = df["transmission"].fillna(df["transmission"].value_counts().sort_values(ascending=False).index[0])

In [128]:
df["fuel_type"] = df["fuel_type"].fillna(df["fuel_type"].value_counts().sort_values(ascending=False).index[0])

In [129]:
df.isnull().sum()

date            0
make            0
model           0
year            0
transmission    0
fuel_type       0
mileage         0
region          0
sale_amount     0
dtype: int64

## Task 3 - Handling Irregulary Cardinality

Check the extent to which there are categorical features with irregular cardinality present in the features in the dataset.

In [130]:
for col in df.columns:
    print(df.groupby(col).sum(numeric_only=True))

             year  mileage  sale_amount
date
2022-05-01  24204   387064       263000
2022-05-02  14134   128849       223200
2022-05-03  18176   199067       232700
2022-05-04  22207   306478       286200
2022-05-05  26251   297591       414500
...           ...      ...          ...
2023-04-26  12107   228774       132900
2023-04-27  16149   205185       180100
2023-04-28  18173   196184       270400
2023-04-29  10096   145758       115900
2023-04-30  16148   197358       205700

[365 rows x 3 columns]
         year   mileage  sale_amount
make
Audi  7682872  88692968    104087800
          year   mileage  sale_amount
model
A1     1069907  12081524      9935500
A3     1576627  21427762     17599000
A4     1128655  15321773     14820800
A5      708789   7522205     10851100
A6      597566   9532995      8937500
Q2      682914   3235726      9970200
Q3     1203479  12312328     17631000
Q5      714935   7258655     14342700
       mileage  sale_amount
year
2008    167200         7500
2009    308876        22100
2010    729997        36300
2011    661110        33100
2012   1021103       109300
2013   1288134       168700
2014   1815547       316600
2015   5726837      1495300
2016   7706078      2571900
2017  14504646      6185400
2018  25465175     15020300
2019  18144896     17208200
2020   4332182      7805400
2021   5991105     41944300
2022    830082     11163400
                 year   mileage  sale_amount
transmission
Auto           262564   2355644      4269000
Automatic     1389484  13624629     22240700
Manual        3488051  48936907     36758700
Semi-Auto     2542773  23775788     40819400
              year   mileage  sale_amount
fuel_type
D           282517   5573729      3246800
Diesel     2540650  47139039     28788300
E           139447    391481      2657600
Electric   1281294   4189736     23458500
P           359408   3321824      4698400
Petrol     3079556  28077159     41238200
          year  sale_amount
mileage
-1       78758      1180700
 901      2022        49000
 904      2021        36400
 921      4042        69400
 933      2022        39500
...        ...          ...
 128400   2016        10500
 136200   2014        10800
 136830   2011         3000
 143000   2017         8800
 226100   2010         3200

[3185 rows x 2 columns]
             year   mileage  sale_amount
region
Connacht  1964649  22835561     26616500
Leinster  2590573  29555944     35143900
Munster   2150370  25253878     29167500
Ulster     977280  11047585     13159900
             year  mileage
sale_amount
1800         2011   101000
2400         2009    99000
3000         4021   234430
3200         4022   308000
3600         2008    91200
...           ...      ...
80600        2022     5000
83900        2020    24200
84000        6066     8300
88200        2022     5500
95200        2021     7200

[482 rows x 2 columns]

Apply appropriate data preprocessing to address any issues with irregular cardinality.

In [131]:
df['transmission'].replace("Auto", "Automatic", inplace=True)
print(df.groupby('transmission').sum(numeric_only=True))

                 year   mileage  sale_amount
transmission
Automatic     1652048  15980273     26509700
Manual        3488051  48936907     36758700
Semi-Auto     2542773  23775788     40819400

In [132]:
df['fuel_type'].replace("D", "Diesel", inplace=True)
df['fuel_type'].replace("E", "Electric", inplace=True)
df['fuel_type'].replace("P", "Petrol", inplace=True)
print(df.groupby('fuel_type').sum(numeric_only=True))

              year   mileage  sale_amount
fuel_type
Diesel     2823167  52712768     32035100
Electric   1420741   4581217     26116100
Petrol     3438964  31398983     45936600

In [133]:
df['mileage'].replace(-1, 0, inplace=True)
print(df.groupby('mileage').sum(numeric_only=True))

          year  sale_amount
mileage
0        78758      1180700
901       2022        49000
904       2021        36400
921       4042        69400
933       2022        39500
...        ...          ...
128400    2016        10500
136200    2014        10800
136830    2011         3000
143000    2017         8800
226100    2010         3200

[3185 rows x 2 columns]

## Task 4 - Data Aggregation

Use data aggregation to analysise how the *total sale amount* for cars sold in the full dataset relates to the *region* in which the sale took place. Sort the regions by highest to lowest total value.

In [134]:
df.groupby("region").sum(numeric_only=True).sort_values(by="sale_amount", ascending=False)

             year   mileage  sale_amount
region
Leinster  2590573  29555962     35143900
Munster   2150370  25253885     29167500
Connacht  1964649  22835572     26616500
Ulster     977280  11047588     13159900

Next, use data aggregation to analysise how the *total sale amount* for cars sold in the full dataset relates to car *model*. Sort the models by highest to lowest total value.

In [135]:
df.groupby("model").sum(numeric_only=True).sort_values(by="sale_amount", ascending=False)

          year   mileage  sale_amount
model
Q3     1203479  12312332     17631000
A3     1576627  21427771     17599000
A4     1128655  15321779     14820800
Q5      714935   7258659     14342700
A5      708789   7522211     10851100
Q2      682914   3235731      9970200
A1     1069907  12081525      9935500
A6      597566   9532999      8937500

## Task 5 - Cross Tabulation

Use cross tabulation to examine the relationship between the *model* and *region* categorical variables.

In [136]:
pd.crosstab(df["model"], df["region"])

region  Connacht  Leinster  Munster  Ulster
model
A1           141       172      146      71
A3           196       260      230      95
A4           142       191      165      61
A5            86       114      101      50
A6            74       112       70      40
Q2            84       113       90      51
Q3           151       195      171      79
Q5            99       126       92      37

Next, use cross tabulation to examine the relationship between the *transmission* and *fuel type* categorical variables.

In this case, normalise the values in the cross-tabulation by row.

In [137]:
df2 = pd.crosstab(df["transmission"], df["fuel_type"])
for d in df2.columns:
    df2[d] = (df2[d] - min(df2[d].values)) / (max(df2[d].values) - min(df2[d].values))
print(df2)

fuel_type       Diesel  Electric    Petrol
transmission
Automatic     0.000000  0.428571  0.000000
Manual        1.000000  0.000000  1.000000
Semi-Auto     0.220551  1.000000  0.547273